# ============================================================
# SKYWATCH-Det — Custom YOLOv11s Face Detection Model
# ============================================================
# Base: YOLOv11s Backbone + Detection Head (4-scale)
# Dataset: WIDER FACE for YOLO (32,203 images, ~393K faces)
#
# Key architectural changes vs standard YOLOv11s:
#   1. P2 detection head (4-scale: P2/P3/P4/P5)
#      → Critical: dataset contains faces as small as 10x10px
#   2. C2f_CAM at P2 level — contextual attention for crowded scenes
#      → Helps detect faces in dense groups (Hard difficulty)
#   3. FRM block placement — feature refinement for blur/noise
#      → Improves detection on low-quality surveillance frames
#   4. nc: 1 — single class: face (YOLO class_id = 0)
#
# Training notes:
#   - face sizes: 10px ~ 500px → scale invariance is critical
#   - partial occlusion common → model learns partial faces
#   - augmentation: mosaic + blur strongly recommended
#
# Sources:
#   - "Enhanced YOLO for Small Object Detection in Surveillance" (P2 head)
#   - "Contextual Feature Enhancement for Small Face Detection" (C2f_CAM)
#   - "Face Detection in Low-quality Images" (FRM)
#   - "WIDER FACE Benchmark" (training strategy)
# ============================================================

nc: 1             # number of classes — face only (WIDER FACE: class_id=0)

scales:
  # Only 's' scale is used for SKYWATCH-Det
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024]  # ~9.5M params — balanced speed/accuracy for Kaggle T4

# ──────────────────────────────────────────────
# YOLOv11s Backbone (unchanged)
# ──────────────────────────────────────────────
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]           # 0 — P1/2   (320x320 @ 640 input)
  - [-1, 1, Conv,  [128, 3, 2]]          # 1 — P2/4   (160x160)
  - [-1, 2, C3k2,  [256, False, 0.25]]   # 2 — P2 features  ← saved for P2 head concat
  - [-1, 1, Conv,  [256, 3, 2]]          # 3 — P3/8   (80x80)
  - [-1, 2, C3k2,  [512, False, 0.25]]   # 4 — P3 features  ← saved for P3 head concat
  - [-1, 1, Conv,  [512, 3, 2]]          # 5 — P4/16  (40x40)
  - [-1, 2, C3k2,  [512, True]]          # 6 — P4 features  ← saved for P4 head concat
  - [-1, 1, Conv,  [1024, 3, 2]]         # 7 — P5/32  (20x20)
  - [-1, 2, C3k2,  [1024, True]]         # 8
  - [-1, 1, SPPF,  [1024, 5]]            # 9  — SPPF
  - [-1, 2, C2PSA, [1024]]               # 10 — P5 with attention (backbone output)

# ──────────────────────────────────────────────
# Head — Top-down (P5→P4→P3→P2) + Bottom-up (P2→P3→P4→P5)
# ──────────────────────────────────────────────
head:
  # ── Top-down path ──────────────────────────
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11 — Upsample P5
  - [[-1, 6], 1, Concat,  [1]]                  # 12 — cat backbone P4 (layer 6)
  - [-1, 2, C3k2,  [512, False]]                # 13 — P4 neck

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14 — Upsample P4
  - [[-1, 4], 1, Concat,  [1]]                  # 15 — cat backbone P3 (layer 4)
  - [-1, 2, C3k2,  [256, False]]                # 16 — P3 neck

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17 — Upsample P3 → P2 scale
  - [[-1, 2], 1, Concat,  [1]]                  # 18 — cat backbone P2 (layer 2)
  # C2f_CAM: P2 level with contextual attention — critical for small faces
  - [-1, 2, C2f_CAM, [128, False]]              # 19 — P2 with contextual attention ★

  # ── Bottom-up path ─────────────────────────
  - [-1, 1, Conv,  [128, 3, 2]]                 # 20 — Downsample P2 → P3
  - [[-1, 16], 1, Concat, [1]]                  # 21 — cat head P3 (layer 16)
  - [-1, 2, C3k2,  [256, False]]                # 22 — P3 output

  - [-1, 1, Conv,  [256, 3, 2]]                 # 23 — Downsample P3 → P4
  - [[-1, 13], 1, Concat, [1]]                  # 24 — cat head P4 (layer 13)
  - [-1, 2, C3k2,  [512, False]]                # 25 — P4 output

  - [-1, 1, Conv,  [512, 3, 2]]                 # 26 — Downsample P4 → P5
  - [[-1, 10], 1, Concat, [1]]                  # 27 — cat P5 (layer 10)
  - [-1, 2, C3k2,  [1024, True]]                # 28 — P5 output

  # ── Detection Head ─────────────────────────
  # 4-scale detection: bbox only (no landmarks — WIDER FACE YOLO format)
  # P2 (19): tiny faces  ≤ 20px  ← most critical for Hard difficulty
  # P3 (22): small       20~60px
  # P4 (25): medium      60~180px
  # P5 (28): large       180px+
  - [[19, 22, 25, 28], 1, Detect, [nc]]           # 29 — Detect(P2, P3, P4, P5)
